# RMS Titanic

## O RMS Titanic foi um navio de passageiros britânico operado pela White Star Line e construído pelos estaleiros da Harland and Wolff em Belfast. Foi a segunda embarcação da Classe Olympic de transatlânticos depois do RMS Olympic e seguido pelo HMHS Britannic. Projetado pelos engenheiros navais Alexander Carlisle e Thomas Andrews, sua construção começou em março de 1909 e ele foi lançado ao mar em maio de 1911. O Titanic foi pensado para ser o navio mais luxuoso e mais seguro de sua época, gerando lendas que era supostamente "inafundável".

## A embarcação partiu em sua viagem inaugural de Southampton para Nova Iorque em 10 de abril de 1912, no caminho passando em Cherbourg-Octeville na França e por Queenstown na Irlanda. Ele colidiu com um iceberg às 23h40min do dia 14 de abril e afundou na madrugada do dia seguinte matando mais de 1500 pessoas, sendo um dos maiores desastres marítimos em tempos de paz de toda a história. Seu naufrágio destacou vários pontos fracos de seu projeto, deficiências nos procedimentos de evacuação de emergência e falhas nas regulamentações marítimas da época. Comissões de inquérito foram instauradas nos Estados Unidos e no Reino Unido, levando a mudanças nas leis internacionais de navegação que permanecem em vigor mais de um século depois.

## Os destroços do Titanic foram procurados por décadas até serem encontrados em 1985 por uma equipe liderada por Robert Ballard. Ele se encontra a 3843 m de profundidade e a 650 km ao sudeste de Terra Nova no Canadá. Sua história e naufrágio permaneceram no imaginário popular durante décadas, levando a produção de vários livros e filmes a seu respeito, mais notavelmente o filme Titanic de 1997. Até hoje o Titanic permanece como um dos navios mais famosos da história, com seus destroços atraindo várias expedições de exploração ao longo dos anos.

*Fonte:* [WikiPedia](https://pt.wikipedia.org/wiki/RMS_Titanic)

--------

## A equipa da [Udacity](https://udacity.com) disponibilizou informações sobre uma parte dos passageiros à bordo do RMS Titanic no dia daquela tragédia. Esse _dataset_ que contém informações reais vem sendo utilizado em diversos estudos de caso, além de servir de base para aprendizado de Ciência de Dados, Estatística e Machine Learning.

## O arquivo **titanic_data.csv** contém informações reais sobre os passageiros organizadas da seguinte forma:

- Survived (Sobreviveu): 0 = Não, 1 = Sim
- Pclass (Classe): Classe de ingresso 1 = 1º, 2 = 2º, 3 = 3º
- Sex (Sexo): Sexo do passageiro
- Age (Idade): Idade em anos
- Sibsp: Quantidade de irmãos / cônjuges a bordo do Titanic
- Parch: Quantidade de pais / crianças a bordo do Titanic
- Ticket (Bilhete): Número do bilhete de embarque
- Fare (Tarifa): Tarifa paga pelo Passageiro
- Cabin (Cabine): Número de cabine
- Embarked (Embarque): Porto de Embarque (C = Cherbourg, Q = Queenstown, S = Southampton)

## O objetivo deste estudo é obter algumas informações estatísticas sobre a tragédia e realizar alguns _insights_ a respeito dos tripulantes e das circunstâncias do acidente.

## Efetue a carga do arquivo através da biblioteca _Pandas_ e a partir do _DataFrame_ gerado, efetue as operações necessárias para responder as questões.

## Importando o DataSet

### 1 - Efetuar a leitura do dataset através do Pandas, gerando um DataFrame de nome tit, levando-se em consideração que o arquivo encontra-se na mesma pasta do notebook.

In [177]:
import pandas as pd

In [21]:
tit = pd.read_csv('titanic_data.csv')

In [22]:
tit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Conhecendo o DataSet

### 2 - Quantas linhas e colunas tem o dataset? Quais os tipos das colunas?

In [7]:
# 891 linhas

In [8]:
# 12 colunas:

#PassengerId      int64
#Survived         int64
#Pclass           int64
#Name             object
#Sex              object
#Age              float64
#SibSp            int64
#Parch            int64
#Ticket           object
#Fare             float64
#Cabin            object
#Embarked         object

### 3 - Mostre os dados dos dez primeiros e 8 últimos registros do dataset.

In [23]:
tit.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [10]:
tit.tail(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.500,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

### 4 - Cálculos envolvendo colunas numéricas com dados faltantes podem sofrer impacto. É possível afirmar se há dados faltantes no dataset? Caso positivo, quais e quantos seriam esses dados? Preencha os dados faltantes de forma que não influenciem em operações futuras.

In [ ]:
# Há dados fatantes nas seguintes colunas:

# Age            714 non-null
# Cabin          204 non-null
# Embarked       889 non-null

In [24]:
tit.fillna(0, inplace = True)
tit.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,0,S

## Adequando o DataSet

### 4 - Uma vez que algumas colunas não serão utilizadas, eventualmente é melhor excluí-las para que não interfiram na análise. Assim, exclua do dataset as colunas Sibsp, Parch e Ticket.

In [25]:
tit.drop(['SibSp','Parch','Ticket'], 1, inplace = True)
tit.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,S

### 5 - Renomear as colunas restantes para a lingua portuguesa, utilizando os seguintes nomes de colunas: IdPassageiro, Sobreviveu, Classe, Nome, Sexo, Idade, Tarifa, Cabine e Embarque.

In [26]:
tit.rename(columns={"PassengerId": "IdPassageiro", 
                    "Survived": "Sobreviveu", 
                    "Pclass": "Classe", 
                    "Name": "Nome", 
                    "Sex": "Sexo", 
                    "Age": "Idade", 
                    "Fare": "Tarifa", 
                    "Cabin": "Cabine", 
                    "Embarked": "Embarque"}, inplace = True)
tit.head(5)

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,S

### 6 - Alterar o conteudo da coluna Sobreviveu para:
- 0 => Não
- 1 => Sim

In [30]:
tit.loc[tit['Sobreviveu'] == 0, 'Sobreviveu'] = 'Não'
tit.loc[tit['Sobreviveu'] == 1, 'Sobreviveu'] = 'Sim'
tit.head(5)

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,Tarifa,Cabine,Embarque
0,1,Não,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,0,S
1,2,Sim,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C85,C
2,3,Sim,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,S
3,4,Sim,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,C123,S
4,5,Não,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,S

### 7 - Alterar o conteudo da coluna Sexo para:
- female => Mulher
- male   => Homem

In [31]:
tit.loc[tit['Sexo'] == 'female', 'Sexo'] = 'Mulher'
tit.loc[tit['Sexo'] == 'male', 'Sexo'] = 'Homem'
tit.head(5)

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,Tarifa,Cabine,Embarque
0,1,Não,3,"Braund, Mr. Owen Harris",Homem,22.0,7.2500,0,S
1,2,Sim,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Mulher,38.0,71.2833,C85,C
2,3,Sim,3,"Heikkinen, Miss. Laina",Mulher,26.0,7.9250,0,S
3,4,Sim,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Mulher,35.0,53.1000,C123,S
4,5,Não,3,"Allen, Mr. William Henry",Homem,35.0,8.0500,0,S

## Alguns números

### 8 - Quantas mulheres e quantos homems estavam à bordo, de acordo com o dataset?

In [37]:
tit.groupby('Sexo').size()

Sexo
Homem     577
Mulher    314
dtype: int64

### 9 - Quantos passageiros sobreviveram e quantos não sobreviveram?

In [38]:
tit.groupby('Sobreviveu').size()

Sobreviveu
Não    549
Sim    342
dtype: int64

### 10 - Quantas mulheres não sobreviveram?

In [146]:
df = tit.groupby(['Sexo','Sobreviveu']).size().reset_index(name='count')
df1 = df[df.Sobreviveu == 'Não']
df2 = df1[df1.Sexo == 'Mulher']
df2

     Sexo Sobreviveu  count
2  Mulher        Não     81

### 11 - Proporcionalmente, sobreviveram mais homens ou mais mulheres? Cite as proporções.

In [86]:
homens = 577
mulheres = 314
pct_homem = (109/homens)*100
pct_mulher = (233/mulheres)*100
print('Porcentagem de homens que sobreviveram: {:.2}%\nPorcentagem de mulheres que sobreviveram: {:.2}%'.format(pct_homem, pct_mulher))

Porcentagem de homens que sobreviveram: 18.89%
Porcentagem de mulheres que sobreviveram: 74.20%

### 12 - Levando-se em consideração a idade dos passageiros, qual a idade e quantidade de pessoas com o maior número de mortos?

In [126]:
df = tit.groupby(['Idade','Sobreviveu']).size().reset_index(name='count')
df1 = df[df.Sobreviveu == 'Não']
df1.agg({'count':sum})
df1.sort_values(by=['count'], ascending=False)[1::]

     Idade Sobreviveu  count
45    21.0        Não     19
61    28.0        Não     18
38    18.0        Não     17
55    25.0        Não     17
47    22.0        Não     16
..     ...        ...    ...
32    15.0        Não      1
31    14.5        Não      1
16     6.0        Não      1
11     3.0        Não      1
142   74.0        Não      1

[77 rows x 3 columns]

### 13 - Qual a média de idade dos homens sobreviventes?

In [141]:
df = tit.groupby(['Idade','Sobreviveu','Sexo']).size().reset_index(name='count')
df1 = df[df.Sobreviveu == 'Sim']
df2 = df1[df1.Sexo == 'Homem']
df2.agg({'count':sum})

df2.mean()

Idade    27.2968
count     2.1800
dtype: float64

### 14 - Levando-se em consideração passageiros prioritários (mulheres e crianças de até 15 anos independente do sexo) qual a proporção de sobreviventes por sexo?

In [148]:
tit[(tit.Idade <= 15) & (tit.Idade > 0) & (tit.Sexo == 'Homem')].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 40 entries, 7 to 869
Data columns (total 9 columns):
IdPassageiro    40 non-null int64
Sobreviveu      40 non-null object
Classe          40 non-null int64
Nome            40 non-null object
Sexo            40 non-null object
Idade           40 non-null float64
Tarifa          40 non-null float64
Cabine          40 non-null object
Embarque        40 non-null object
dtypes: float64(2), int64(2), object(5)
memory usage: 3.1+ KB

In [149]:
tit[(tit.Idade <= 15) & (tit.Idade > 0) & (tit.Sexo == 'Homem') & (tit.Sobreviveu == 'Sim')].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21 entries, 78 to 869
Data columns (total 9 columns):
IdPassageiro    21 non-null int64
Sobreviveu      21 non-null object
Classe          21 non-null int64
Nome            21 non-null object
Sexo            21 non-null object
Idade           21 non-null float64
Tarifa          21 non-null float64
Cabine          21 non-null object
Embarque        21 non-null object
dtypes: float64(2), int64(2), object(5)
memory usage: 1.6+ KB

In [154]:
jovens = 40
pct_jovens = (21/jovens)*100
print('Porcentagem de homens abaixo de 15 anos que sobreviveram: {:.2f}%\nPorcentagem de mulheres que sobreviveram: {:.2f}%'.format(pct_jovens, pct_mulher))

Porcentagem de homens abaixo de 15 anos que sobreviveram: 52.50%
Porcentagem de mulheres que sobreviveram: 74.20%

### 15 - Qual a quantidade de passageiros por classe?

In [ ]:
df = tit.groupby(['Idade','Sobreviveu','Sexo']).size()

### 16 - Qual o percentual de sobreviventes por classe?

In [153]:
df = tit.groupby(['Classe','Sobreviveu']).size()
df

Classe  Sobreviveu
1       Não            80
        Sim           136
2       Não            97
        Sim            87
3       Não           372
        Sim           119
dtype: int64

In [164]:
classe_1 = 80+136
classe_2 = 97+87
classe_3 = 372+119
pct_1 = (136/classe_1)*100
pct_2 = (87/classe_2)*100
pct_3 = (119/classe_3)*100
print('Sobreviventes classe 1: {:.2f}%\nSobreviventes classe 2: {:.2f}%\nSobreviventes classe 3: {:.2f}%'.format(pct_1,pct_2,pct_3))

Sobreviventes classe 1: 62.96%
Sobreviventes classe 2: 47.28%
Sobreviventes classe 3: 24.24%

### 17 - Crie um dataframe que demonstre a quantidade de sobreviventes e não sobreviventes, agrupados por sexo e classe.

In [169]:
df = tit.groupby(['Sobreviveu','Sexo','Classe']).size().reset_index(name='count')
df

   Sobreviveu    Sexo  Classe  count
0         Não   Homem       1     77
1         Não   Homem       2     91
2         Não   Homem       3    300
3         Não  Mulher       1      3
4         Não  Mulher       2      6
5         Não  Mulher       3     72
6         Sim   Homem       1     45
7         Sim   Homem       2     17
8         Sim   Homem       3     47
9         Sim  Mulher       1     91
10        Sim  Mulher       2     70
11        Sim  Mulher       3     72

### 18 - Dos homens com idade entre 24 e 30 anos quantos da classe 3 sobreviveram? Quantos da classe 2 não sobreviveram?

In [175]:
# Sobreviveram 12 homens com idades entre 24 e 30 anos da classe 3

In [173]:
tit[(tit.Idade <= 30) & (tit.Idade >= 24) & (tit.Sexo == 'Homem') & (tit.Sobreviveu == 'Sim') & (tit.Classe == 3)].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 81 to 821
Data columns (total 9 columns):
IdPassageiro    12 non-null int64
Sobreviveu      12 non-null object
Classe          12 non-null int64
Nome            12 non-null object
Sexo            12 non-null object
Idade           12 non-null float64
Tarifa          12 non-null float64
Cabine          12 non-null object
Embarque        12 non-null object
dtypes: float64(2), int64(2), object(5)
memory usage: 960.0+ bytes

In [176]:
# Morreram 24 homens com idades entre 24 e 30 anos da classe 2

In [174]:
tit[(tit.Idade <= 30) & (tit.Idade >= 24) & (tit.Sexo == 'Homem') & (tit.Sobreviveu == 'Não') & (tit.Classe == 2)].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24 entries, 117 to 886
Data columns (total 9 columns):
IdPassageiro    24 non-null int64
Sobreviveu      24 non-null object
Classe          24 non-null int64
Nome            24 non-null object
Sexo            24 non-null object
Idade           24 non-null float64
Tarifa          24 non-null float64
Cabine          24 non-null object
Embarque        24 non-null object
dtypes: float64(2), int64(2), object(5)
memory usage: 1.9+ KB

### 19 - Calcule a probabilidade condicional de uma pessoa sobreviver, dado seu sexo e a classe em que estava viajando:
- P(S= true | G=female,C=1)
- P(S= true | G=female,C=2)
- P(S= true | G=female,C=3)
- P(S= true | G=male,C=1)
- P(S= true | G=male,C=2)
- P(S= true | G=male,C=3)

In [264]:
# apenas consegui resolver trabalhando com valores 0 e 1 para a coluna Sobreviveu

In [265]:
tit.loc[tit['Sobreviveu'] == 'Não', 'Sobreviveu'] = 0
tit.loc[tit['Sobreviveu'] == 'Sim', 'Sobreviveu'] = 1

/Users/leonardofaverobocardi/anaconda3/anaconda3/envs/python3/lib/python3.7/site-packages/pandas/core/ops/__init__.py:1115: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

In [266]:
tit.groupby(['Sexo','Classe']).mean()['Sobreviveu']

Sexo    Classe
Homem   1         0.368852
        2         0.157407
        3         0.135447
Mulher  1         0.968085
        2         0.921053
        3         0.500000
Name: Sobreviveu, dtype: float64